# Execute this file with 'brew bundle'.
# Run install.sh after this.

##############################################################################
# Text and files

# Treat text as a database.
brew "q"

# Make JSON greppable.
brew "gron"

# CLI program that accepts piped input and presents files for selection.
brew "fpp"

# Lightweight and flexible command-line JSON processor.
brew "jq"

##############################################################################
# Programming

# PHP programming language.
brew "php"

# Distributed revision control system.
brew "git"

# Interpreted, interactive, object-oriented programming language.
brew "python"

# Ruby packages.
brew "ruby-build"
brew "rbenv"

# Platform built on V8 to build network applications.
brew "node"

# DDev.
tap "drud/ddev"
brew "ddev"

# Tmux and related.
brew "tmux"
brew "reattach-to-user-namespace"

# Nerd fonts.
tap "caskroom/fonts"
cask "font-hack-nerd-font"

# Clone of cat(1) with syntax highlighting and Git integration.
brew "bat"

# Text interface for Git repositories.
brew "tig"

# User-friendly cURL replacement (command-line HTTP client).
brew "httpie"

# Internet file retriever.
brew "wget"

##############################################################################
# Search

# Command-line fuzzy finder written in Go.
brew "fzf"

# Code-search similar to ack.
brew "the_silver_searcher"

# Interactively filter results from a command (like fzf).
brew "peco"

# Simple, fast and user-friendly alternative to find.
brew "fd"

##############################################################################
# Utilities

# A next-generation plugin manager for zsh
brew "zplug"

# Modern replacement for 'ls'.
brew "exa"

# Analyze and free disk space.
brew "ncdu"

# Asynchronous event library.
brew "libevent"

# RCM used for installing dotfiles.
tap "thoughtbot/formulae"
brew "rcm"

# Programmatically correct mistyped console commands.
brew "thefuck"

# Improved top (interactive process viewer).
brew "htop"

# Port scanning utility for large networks.
brew "nmap"

# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"

# Executes a program periodically, showing output fullscreen.
brew "watch"

# Command-line benchmark tool.
brew "bench"

# HTTP benchmarking tool.
brew "wrk"
