##############################################################################
# Text and files

# Treat text as a database.
brew "q"

# Make JSON greppable.
brew "gron"

# CLI program that accepts piped input and presents files for selection.
brew "fpp"

# Lightweight and flexible command-line JSON processor.
brew "jq"

##############################################################################
# Programming

# PHP programming language.
brew 'php'
brew 'composer'
brew 'phpmd'
brew 'phpunit'
brew 'phplint'

# Distributed revision control system.
brew "git"

# VIM.
brew "vim"

# Fast GitHub client, used in git-create-pull-request.
brew 'hub'

# Interpreted, interactive, object-oriented programming language.
brew "python"

# Ruby packages.
brew "ruby-build"
brew "rbenv"

# Platform built on V8 to build network applications.
brew "node"
brew 'npm'
brew 'nvm'

# DDev.
tap "drud/ddev"
brew "ddev"

# Docker.
brew 'docker'

# Tmux and related.
brew "tmux"
brew "reattach-to-user-namespace"

# Clone of cat(1) with syntax highlighting and Git integration.
brew "bat"

# Text interface for Git repositories.
brew "tig"

# User-friendly cURL replacement (command-line HTTP client).
brew "httpie"

# Internet file retriever.
brew "wget"

##############################################################################
# Search

# Command-line fuzzy finder written in Go.
brew "fzf"

# Code-search similar to ack.
brew "the_silver_searcher"

# Interactively filter results from a command (like fzf).
brew "peco"

# Simple, fast and user-friendly alternative to find.
brew "fd"

##############################################################################
# Utilities

# Todoist CLI.
# Will need to enter API token after first run:
# https://todoist.com/prefs/integrations
tap 'sachaos/todoist'
brew 'todoist'

# A next-generation plugin manager for zsh
brew "zplug"

# Modern replacement for 'ls'.
brew "exa"

# Analyze and free disk space.
brew "ncdu"

# Asynchronous event library.
brew "libevent"

# RCM used for installing dotfiles.
tap "thoughtbot/formulae"
brew "rcm"

# Programmatically correct mistyped console commands.
brew "thefuck"

# Official AWS CLI
brew 'awscli'

# Improved top (interactive process viewer).
brew "htop"

# Port scanning utility for large networks.
brew "nmap"

# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"

# Executes a program periodically, showing output fullscreen.
brew "watch"

# Command-line benchmark tool.
brew "bench"

# HTTP benchmarking tool.
brew "wrk"

##############################################################################
# Casks

# Main applications that I use.
cask 'firefox'
cask 'slack'
cask 'postman'
cask 'sequel-pro'
cask 'harvest'
cask 'grammarly'
cask 'kindle'
cask 'evernote'
cask 'notion'
cask 'pocket-casts'
cask 'google-backup-and-sync'
cask 'marshallofsound-google-play-music-player'
cask 'whatsapp'

# Java and Chromedriver for Behat tests.
cask 'java'
cask 'chromedriver'

# Viewing docker containers.
cask 'kitematic'

# Docker.
cask 'docker'

# Vagrant.
cask 'vagrant'
cask 'virtualbox'

# Office suite.
cask 'libreoffice'

# Proton VPN client.
cask 'protonvpn'

# Handbrake video file editor.
cask 'handbrake'

# Hazel file organizer.
cask 'hazel'

# Nerd fonts.
tap "caskroom/fonts"
cask "font-hack-nerd-font"

# Focus app.
cask 'focus'

# Keyboard remapping for MacOS.
cask 'karabiner-elements'

# Resizing and moving around apps and windows.
cask 'spectacle'

# 1Password.
cask '1password'
cask '1password-cli'

# aText.
cask 'atext'

# Dropbox.
cask 'dropbox'

# Caffeine to keep the display on.
cask 'caffeine'

# Removes blue light at night time.
cask 'flux'
