##############################################################################
# Programming

# PHP packages.
brew 'php'
brew 'composer'

# Python packages.
brew 'python'
brew 'pyenv'

# Ruby packages.
brew 'ruby-build'
brew 'rbenv'

# Other programming languages.
brew 'clojure'
brew 'erlang'
brew 'io'
brew 'scala'
brew 'swi-prolog'

# Databases.
brew 'mysql'
brew 'postgresql'
brew 'redis'

# Enterprise search platform from the Apache Lucene project.
brew 'solr'

# Distributed revision control system.
brew 'git'

# Vi 'workalike' with many additional features.
brew 'vim'

# Tmux and related.
brew 'tmux'
brew 'reattach-to-user-namespace'

# Platform built on V8 to build network applications.
brew 'node'
brew 'npm'
brew 'nvm'

# DDev.
tap 'drud/ddev'
brew 'ddev'

# Pack, ship and run any application as a lightweight container.
brew 'docker'

##############################################################################
# Programming Utilities

# Git utilities.
# https://github.com/nvie/gitflow
# https://github.com/ddollar/git-utils
brew 'hub'
brew 'git-flow'
brew 'git-utils'

# Text interface for Git repositories.
brew 'tig'

# User-friendly cURL replacement (command-line HTTP client).
brew 'httpie'

# Internet file retriever.
brew 'wget'

# Small collection of programs that operate on patch files.
brew 'patchutils'

# Automatic configure script builder.
brew 'autoconf'

# Makefiles.
brew 'automake'
brew 'cmake'

# Exuberant ctags instead of regular ctags.
brew 'ctags'

##############################################################################
# Search

# Command-line fuzzy finder written in Go.
brew 'fzf'

# Code-search similar to ack.
brew 'the_silver_searcher'

# Interactively filter results from a command (like fzf).
brew 'peco'

# Simple, fast and user-friendly alternative to find.
brew 'fd'

# Search tool like grep, but optimized for programmers.
brew 'ack'

##############################################################################
# Text and files

# Clone of cat(1) with syntax highlighting and Git integration.
brew 'bat'

# Modern replacement for 'ls'.
brew 'exa'

# Treat text as a database.
brew 'q'

# Make JSON greppable.
brew 'gron'

# CLI program that accepts piped input and presents files for selection.
brew 'fpp'

# Lightweight and flexible command-line JSON processor.
brew 'jq'

# Rename files.
brew 'rename'

##############################################################################
# Utilities

# Todoist CLI.
# Will need to enter API token after first run:
# https://todoist.com/prefs/integrations
tap 'sachaos/todoist'
brew 'todoist'

# ZSH plugins.
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# A next-generation plugin manager for zsh.
brew 'zplug'

# Analyze and free disk space.
brew 'ncdu'

# RCM used for installing dotfiles.
tap 'thoughtbot/formulae'
brew 'rcm'

# Programmatically correct mistyped console commands.
brew 'thefuck'

# Official AWS CLI.
brew 'awscli'

# Improved top (interactive process viewer).
brew 'htop'

# Port scanning utility for large networks.
brew 'nmap'

# Lynx-like WWW browser that supports tables, menus, etc.
brew 'links'

# Executes a program periodically, showing output fullscreen.
brew 'watch'

# Command-line benchmark tool.
brew 'bench'

# HTTP benchmarking tool.
brew 'wrk'

# Asynchronous event library.
brew 'libevent'

# Tools and libraries to manipulate images in many formats.
brew 'imagemagick'

##############################################################################
# Casks

# Main applications that I use.
cask 'firefox'
cask 'kindle'

# Work related.
cask 'harvest'
cask 'toggl'

# Programming.
cask 'sequel-pro'
cask 'postman'
cask 'java'
cask 'docker'
cask 'kitematic'
cask 'vagrant'
cask 'virtualbox'

# Chromedriver and geckodriver (Firefox) for behavioral tests.
cask 'chromedriver'
brew 'geckodriver'

# Nerd fonts.
tap 'caskroom/fonts'
cask 'font-hack-nerd-font'

# Notes.
cask 'evernote'
cask 'notion'
cask 'libreoffice'
cask 'grammarly'

# Messaging.
cask 'whatsapp'
cask 'signal'
cask 'slack'

# File syncing.
cask 'nextcloud'

# Video and Music.
cask 'marshallofsound-google-play-music-player'
cask 'spotify'
cask 'handbrake'
cask 'pocket-casts'

# Proton VPN client.
cask 'protonvpn'

# Productivity.
cask 'spectacle'
cask 'atext'

# Keyboard remapping for MacOS.
cask 'karabiner-elements'

# 1Password.
cask '1password'
cask '1password-cli'

# Tools.
cask 'hazel'
cask 'caffeine'
cask 'flux'
